Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129LNCZAD.svd
        <register>
          <name>STAT</name>
          <description>EPI Status</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>EPI_STAT_ACTIVE</name>
              <description>Register Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_NBRBUSY</name>
              <description>Non-Blocking Read Busy</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_WBUSY</name>
              <description>Write Busy</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_INITSEQ</name>
              <description>Initialization Sequence</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFEMPTY</name>
              <description>External FIFO Empty</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFFULL</name>
              <description>External FIFO Full</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFOCNT</name>
          <description>EPI Read FIFO Count</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>EPI_RFIFOCNT_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO0</name>
          <description>EPI Read FIFO</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO0_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO1</name>
          <description>EPI Read FIFO Alias 1</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO1_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO2</name>
          <description>EPI Read FIFO Alias 2</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO2_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO3</name>
          <description>EPI Read FIFO Alias 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO3_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO4</name>
          <description>EPI Read FIFO Alias 4</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO4_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO5</name>
          <description>EPI Read FIFO Alias 5</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO5_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO6</name>
          <description>EPI Read FIFO Alias 6</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO6_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO7</name>
          <description>EPI Read FIFO Alias 7</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO7_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLVL</name>
          <description>EPI FIFO Level Selects</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>EPI_FIFOLVL_RDFIFO</name>
              <description>Read FIFO</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1</name>
                  <description>Trigger when there are 1 or more entries in the NBRFIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_2</name>
                  <description>Trigger when there are 2 or more entries in the NBRFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_4</name>
                  <description>Trigger when there are 4 or more entries in the NBRFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_6</name>
                  <description>Trigger when there are 6 or more entries in the NBRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_7</name>
                  <description>Trigger when there are 7 or more entries in the NBRFIFO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_8</name>
                  <description>Trigger when there are 8 entries in the NBRFIFO</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_WRFIFO</name>
              <description>Write FIFO</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_EMPT</name>
                  <description>Interrupt is triggered while WRFIFO is empty.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_2</name>
                  <description>Interrupt is triggered until there are only two slots available. Thus, trigger is deasserted when there are two WRFIFO entries present. This configuration is optimized for bursts of 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1</name>
                  <description>Interrupt is triggered until there is one WRFIFO entry available. This configuration expects only single writes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_NFULL</name>
                  <description>Trigger interrupt when WRFIFO is not full, meaning trigger will continue to assert until there are four entries in the WRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_RSERR</name>
              <description>Read Stall Error</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_FIFOLVL_WFERR</name>
              <description>Write Full Error</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WFIFOCNT</name>
          <description>EPI Write FIFO Count</description>
          <addressOffset>0x00000204</addressOffset>
          <fields>
            <field>
              <name>EPI_WFIFOCNT_WTAV</name>
              <description>Available Write Transactions</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXCNT</name>
          <description>EPI DMA Transmit Count</description>
          <addressOffset>0x00000208</addressOffset>
          <fields>
            <field>
              <name>EPI_DMATXCNT_TXCNT</name>
              <description>DMA Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>EPI Interrupt Mask</description>
          <addressOffset>0x00000210</addressOffset>
          <fields>
            <field>
              <name>EPI_IM_ERRIM</name>
              <description>Error Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_IM_RDIM</name>
              <description>Read FIFO Full Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_IM_WRIM</name>
              <description>Write FIFO Empty Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPI_IM_DMARDIM</name>
              <description>Read uDMA Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPI_IM_DMAWRIM</name>
              <description>Write uDMA Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>EPI Raw Interrupt Status</description>
          <addressOffset>0x00000214</addressOffset>
          <fields>
            <field>
              <name>EPI_RIS_ERRRIS</name>
              <description>Error Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_RDRIS</name>
              <description>Read Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_WRRIS</name>
              <description>Write Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_DMARDRIS</name>
              <description>Read uDMA Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_DMAWRRIS</name>
              <description>Write uDMA Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>EPI Masked Interrupt Status</description>
          <addressOffset>0x00000218</addressOffset>
          <fields>
            <field>
              <name>EPI_MIS_ERRMIS</name>
              <description>Error Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_RDMIS</name>
              <description>Read Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_WRMIS</name>
              <description>Write Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_DMARDMIS</name>
              <description>Read uDMA Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_DMAWRMIS</name>
              <description>Write uDMA Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EISC</name>
          <description>EPI Error and Interrupt Status and Clear</description>
          <addressOffset>0x0000021C</addressOffset>
          <fields>
            <field>
              <name>EPI_EISC_TOUT</name>
              <description>Timeout Error</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_RSTALL</name>
              <description>Read Stalled Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_WTFULL</name>
              <description>Write FIFO Full Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_DMARDIC</name>
              <description>Read uDMA Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_DMAWRIC</name>
              <description>Write uDMA Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8CFG3</name>
          <description>EPI Host-Bus 8 Configuration 3</description>
          <addressOffset>0x00000308</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8CFG3_MODE</name>
              <description>CS2n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_RDWS</name>
              <description>CS2n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_WRWS</name>
              <description>CS2n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_ALEHIGH</name>
              <description>CS2n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG3_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG3_WRHIGH</name>
              <description>CS2n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16CFG3</name>
          <description>EPI Host-Bus 16 Configuration 3</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000308</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG3_MODE</name>
              <description>CS2n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDWS</name>
              <description>CS2n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRWS</name>
              <description>CS2n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_BURST</name>
              <description>CS2n Burst Mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDCRE</name>
              <description>CS2n PSRAM Configuration Register Read</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRCRE</name>
              <description>CS2n PSRAM Configuration Register Write</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG3_ALEHIGH</name>
              <description>CS2n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRHIGH</name>
              <description>CS2n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
