Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129LNCZAD.svd
        <register>
          <name>DMABUSMOD</name>
          <description>Ethernet MAC DMA Bus Mode</description>
          <addressOffset>0x00000C00</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMABUSMOD_SWR</name>
              <description>DMA Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DA</name>
              <description>DMA Arbitration Scheme</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DSL</name>
              <description>Descriptor Skip Length</description>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_ATDS</name>
              <description>Alternate Descriptor Size</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PBL</name>
              <description>Programmable Burst Length</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PR</name>
              <description>Priority Ratio</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_FB</name>
              <description>Fixed Burst</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RPBL</name>
              <description>RX DMA Programmable Burst Length (PBL)</description>
              <bitRange>[22:17]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_USP</name>
              <description>Use Separate Programmable Burst Length (PBL)</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_8XPBL</name>
              <description>8 x Programmable Burst Length (PBL) Mode</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_AAL</name>
              <description>Address Aligned Beats</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_MB</name>
              <description>Mixed Burst</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_TXPR</name>
              <description>Transmit Priority</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RIB</name>
              <description>Rebuild Burst</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOLLD</name>
          <description>Ethernet MAC Transmit Poll Demand</description>
          <addressOffset>0x00000C04</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>EMAC_TXPOLLD_TPD</name>
              <description>Transmit Poll Demand</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPOLLD</name>
          <description>Ethernet MAC Receive Poll Demand</description>
          <addressOffset>0x00000C08</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>EMAC_RXPOLLD_RPD</name>
              <description>Receive Poll Demand</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLADDR</name>
          <description>Ethernet MAC Receive Descriptor List Address</description>
          <addressOffset>0x00000C0C</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXDLADDR_STRXLIST</name>
              <description>Start of Receive List</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDLADDR</name>
          <description>Ethernet MAC Transmit Descriptor List Address</description>
          <addressOffset>0x00000C10</addressOffset>
          <fields>
            <field>
              <name>EMAC_TXDLADDR_TXDLADDR</name>
              <description>Start of Transmit List Base Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARIS</name>
          <description>Ethernet MAC DMA Interrupt Status</description>
          <addressOffset>0x00000C14</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMARIS_TI</name>
              <description>Transmit Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TPS</name>
              <description>Transmit Process Stopped</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TU</name>
              <description>Transmit Buffer Unavailable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TJT</name>
              <description>Transmit Jabber Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_OVF</name>
              <description>Receive Overflow</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_UNF</name>
              <description>Transmit Underflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RI</name>
              <description>Receive Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RU</name>
              <description>Receive Buffer Unavailable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RPS</name>
              <description>Receive Process Stopped</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RWT</name>
              <description>Receive Watchdog Timeout</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_ETI</name>
              <description>Early Transmit Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_ERI</name>
              <description>Early Receive Interrupt</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_NIS</name>
              <description>Normal Interrupt Summary</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RS</name>
              <description>Received Process State</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_STOP</name>
                  <description>Stopped: Reset or stop receive command issued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXTD</name>
                  <description>Running: Fetching receive transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXD</name>
                  <description>Running: Waiting for receive packet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_SUSPEND</name>
                  <description>Suspended: Receive descriptor unavailable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNCRD</name>
                  <description>Running: Closing receive descriptor</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_TSWS</name>
                  <description>Writing Timestamp</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNTXD</name>
                  <description>Running: Transferring the receive packet data from receive buffer to host memory</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_TS</name>
              <description>Transmit Process State</description>
              <bitRange>[22:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STOP</name>
                  <description>Stopped; Reset or Stop transmit command processed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTXTD</name>
                  <description>Running; Fetching transmit transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STATUS</name>
                  <description>Running; Waiting for status</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTX</name>
                  <description>Running; Reading data from host memory buffer and queuing it to transmit buffer (TX FIFO)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_TSTAMP</name>
                  <description>Writing Timestamp</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_SUSPEND</name>
                  <description>Suspended; Transmit descriptor unavailable or transmit buffer underflow</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNCTD</name>
                  <description>Running; Closing transmit descriptor</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_AE</name>
              <description>Access Error</description>
              <bitRange>[25:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMAWD</name>
                  <description>Error during RX DMA Write Data Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMARD</name>
                  <description>Error during TX DMA Read Data Transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADW</name>
                  <description>Error during RX DMA Descriptor Write Access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADW</name>
                  <description>Error during TX DMA Descriptor Write Access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADR</name>
                  <description>Error during RX DMA Descriptor Read Access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADR</name>
                  <description>Error during TX DMA Descriptor Read Access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_MMC</name>
              <description>MAC MMC Interrupt</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_PMT</name>
              <description>MAC PMT Interrupt Status</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TT</name>
              <description>Timestamp Trigger Interrupt Status</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAOPMODE</name>
          <description>Ethernet MAC DMA Operation Mode</description>
          <addressOffset>0x00000C18</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMAOPMODE_SR</name>
              <description>Start or Stop Receive</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_OSF</name>
              <description>Operate on Second Frame</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RTC</name>
              <description>Receive Threshold Control</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_32</name>
                  <description>32 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_96</name>
                  <description>96 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_128</name>
                  <description>128 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DGF</name>
              <description>Drop Giant Frame Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FUF</name>
              <description>Forward Undersized Good Frames</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FEF</name>
              <description>Forward Error Frames</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_ST</name>
              <description>Start or Stop Transmission Command</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TTC</name>
              <description>Transmit Threshold Control</description>
              <bitRange>[16:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_128</name>
                  <description>128 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_192</name>
                  <description>192 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_256</name>
                  <description>256 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_40</name>
                  <description>40 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_32</name>
                  <description>32 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_24</name>
                  <description>24 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_16</name>
                  <description>16 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FTF</name>
              <description>Flush Transmit FIFO</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TSF</name>
              <description>Transmit Store and Forward</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RSF</name>
              <description>Receive Store and Forward</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIM</name>
          <description>Ethernet MAC DMA Interrupt Mask Register</description>
          <addressOffset>0x00000C1C</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMAIM_TIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TSE</name>
              <description>Transmit Stopped Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TUE</name>
              <description>Transmit Buffer Unvailable Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TJE</name>
              <description>Transmit Jabber Timeout Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_OVE</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_UNE</name>
              <description>Underflow Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RSE</name>
              <description>Receive Stopped Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_FBE</name>
              <description>Fatal Bus Error Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MFBOC</name>
          <description>Ethernet MAC Missed Frame and Buffer Overflow Counter</description>
          <addressOffset>0x00000C20</addressOffset>
          <fields>
            <field>
              <name>EMAC_MFBOC_MISFRMCNT</name>
              <description>Missed Frame Counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_MISCNTOVF</name>
              <description>Overflow bit for Missed Frame Counter</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFFRMCNT</name>
              <description>Overflow Frame Counter</description>
              <bitRange>[27:17]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
